# Задайте последовательность чисел. Напишите программу, которая выведет список неповторяющихся
# элементов исходной последовательности.

a = [1, 2, 2, 1, 56, -100, 56, 78, 56]
print(sorted(set(a)))
